Enums/ВариантыОтсчетаДатыПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОтсчетаДатыПлатежа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтДатыЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоДатыОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяДата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтДатыПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЭтапОплаты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры,,"ТолькоПросмотр,ЗакрыватьПриВыборе,ЗакрыватьПриЗакрытииВладельца,КлючНазначенияИспользования");
	
	УстановитьУсловноеОформление();
	
	ЕстьТара = СуммаЗалогаПоДокументу <> 0;
	Если Операция = "Добавление" Тогда
		Если НЕ ЗначениеЗаполнено(ВариантОплаты) Тогда
			ВариантОплаты = ?(ЭтоРасчетыСКлиентами,
				Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки,
				Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВариантОтсчета) Тогда
			ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
			ДатаПлатежа = ДатаЗаказа;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоДоговор Тогда
		Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа, НСтр("ru='от даты договора'"));
	Иначе
		Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа);
		Если ПолучитьФункциональнуюОпцию("НеБазоваяВерсия") Тогда
			Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования);
		КонецЕсли;
	КонецЕсли;
	Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ДоДатыОтгрузки);
	Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки);
	Если ЭтоРасчетыСКлиентами
		И ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_0") Тогда
		Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПереходаПраваСобственности);
	КонецЕсли;
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыПоступления);
	КонецЕсли;
	Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата);
	Элементы.ВариантОтсчета.СписокВыбора.Добавить(Перечисления.ВариантыОтсчетаДатыПлатежа.Формула);
	
	Если ЭтоРасчетыСКлиентами Тогда
		Если НЕ ЭтоДоговор Тогда
			Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.АвансДоОбеспечения);
		КонецЕсли;
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.ПредоплатаДоОтгрузки);
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.КредитСдвиг);
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки);
	Иначе
		Если НЕ ЭтоДоговор Тогда
			Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения);
		КонецЕсли;
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления);
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг);
		Элементы.ВариантОплаты.СписокВыбора.Добавить(Перечисления.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления);
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
	ИсходныйВариантОтсчетаЗависитОтДатыОтгрузки = ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(ВариантОтсчета, Формула);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СдвигПриИзменении(Элемент)
	
	ДанныеЭтапа = Новый Структура;
	ДанныеЭтапа.Вставить("ДатаПлатежа",    ДатаПлатежа);
	ДанныеЭтапа.Вставить("Сдвиг",          Сдвиг);
	ДанныеЭтапа.Вставить("ВариантОтсчета", ВариантОтсчета);
	ДанныеЭтапа.Вставить("ВариантОплаты",  ВариантОплаты);
	ДанныеЭтапа.Вставить("Формула",        Формула);
	
	ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = ДатаЗаказа;
	ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = ДатаСогласования;
	ПараметрыРасчетаДатыПлатежа.ДатаОтгрузки                   = Дата(1,1,1);
	ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
	ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
	ПараметрыРасчетаДатыПлатежа.Календарь                      = Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
		ДанныеЭтапа,ПараметрыРасчетаДатыПлатежа);
	
	ДатаПлатежа = ДанныеЭтапа.ДатаПлатежа;
	ВариантОплаты = ДанныеЭтапа.ВариантОплаты;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтсчетаПриИзменении(Элемент)
	
	Если ВариантОтсчета <> ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.Формула") Тогда
		Формула = Неопределено;
		
		ДанныеЭтапа = Новый Структура;
		ДанныеЭтапа.Вставить("ДатаПлатежа",    ДатаПлатежа);
		ДанныеЭтапа.Вставить("Сдвиг",          Сдвиг);
		ДанныеЭтапа.Вставить("ВариантОтсчета", ВариантОтсчета);
		ДанныеЭтапа.Вставить("ВариантОплаты",  ВариантОплаты);
		ДанныеЭтапа.Вставить("Формула",        Формула);
		
		//Данный элемент доступен только для вариантов отсчета независящих от даты отгрузки
		ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
		ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = ДатаЗаказа;
		ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = ДатаСогласования;
		ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
		ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
		ПараметрыРасчетаДатыПлатежа.Календарь                      = Календарь;
		
		ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
			ДанныеЭтапа,ПараметрыРасчетаДатыПлатежа);
		
		ДатаПлатежа = ДанныеЭтапа.ДатаПлатежа;
		ВариантОплаты = ДанныеЭтапа.ВариантОплаты;
	КонецЕсли;
	
	Если ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата") Тогда
		Сдвиг = 0;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаПриИзменении(Элемент)
	
	ДанныеЭтапа = Новый Структура;
	ДанныеЭтапа.Вставить("ДатаПлатежа",    ДатаПлатежа);
	ДанныеЭтапа.Вставить("Сдвиг",          Сдвиг);
	ДанныеЭтапа.Вставить("ВариантОтсчета", ВариантОтсчета);
	ДанныеЭтапа.Вставить("ВариантОплаты",  ВариантОплаты);
	ДанныеЭтапа.Вставить("Формула",        Формула);
	
	//Данный элемент доступен только для вариантов отсчета независящих от даты отгрузки
	ПараметрыРасчетаДатыПлатежа = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыРасчетаДатыПлатежа.ДатаЗаказа                     = ДатаЗаказа;
	ПараметрыРасчетаДатыПлатежа.ДатаСогласования               = ДатаСогласования;
	ПараметрыРасчетаДатыПлатежа.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
	ПараметрыРасчетаДатыПлатежа.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
	ПараметрыРасчетаДатыПлатежа.Календарь                      = Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыСдвигВариантОтсчетаПриИзменении(
		ДанныеЭтапа,ПараметрыРасчетаДатыПлатежа);
	
	ДатаПлатежа = ДанныеЭтапа.ДатаПлатежа;
	ВариантОплаты = ДанныеЭтапа.ВариантОплаты;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПлатежаПриИзменении(Элемент)
	
	Если ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа")
		И ДатаПлатежа < ДатаЗаказа Тогда
		ДатаПлатежа = ДатаЗаказа;
	ИначеЕсли ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования")
		И ЗначениеЗаполнено(ДатаСогласования) И ДатаПлатежа < ДатаСогласования Тогда
		ДатаПлатежа = ДатаСогласования;  
	ИначеЕсли ВариантОтсчета = ПредопределенноеЗначение("Перечисление.ВариантыОтсчетаДатыПлатежа.ОтДатыСогласования")
		И НЕ ЗначениеЗаполнено(ДатаСогласования) И ДатаПлатежа < ДатаЗаказа Тогда
		ДатаПлатежа = ДатаЗаказа;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ДатаПлатежа",    ДатаПлатежа);
	Структура.Вставить("Сдвиг",          Сдвиг);
	Структура.Вставить("ВариантОтсчета", ВариантОтсчета);
	Структура.Вставить("ВариантОплаты",  ВариантОплаты);
	Структура.Вставить("Формула",        Формула);
	
	ПараметрыЗаполненияСдвига = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияСдвига.ДатаЗаказа                     = ДатаЗаказа;
	ПараметрыЗаполненияСдвига.ДатаСогласования               = ДатаСогласования;
	ПараметрыЗаполненияСдвига.ДатаОтгрузки                   = Дата(1,1,1);
	ПараметрыЗаполненияСдвига.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
	ПараметрыЗаполненияСдвига.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
	ПараметрыЗаполненияСдвига.Календарь                      = Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыДатаПлатежаПриИзменении(
		Структура,ПараметрыЗаполненияСдвига);
	
	Сдвиг = Структура.Сдвиг;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПлатежаПриИзменении(Элемент)
	СуммаПлатежа = СуммаОплатыПоДокументу * ПроцентПлатежа / 100;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентЗалогаЗаТаруПриИзменении(Элемент)
	СуммаЗалогаЗаТару = СуммаЗалогаПоДокументу * ПроцентЗалогаЗаТару / 100;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПлатежаПриИзменении(Элемент)
	ПроцентПлатежа = ?(СуммаОплатыПоДокументу = 0, 0, СуммаПлатежа / СуммаОплатыПоДокументу * 100);
КонецПроцедуры

&НаКлиенте
Процедура СуммаЗалогаЗаТаруПриИзменении(Элемент)
	ПроцентЗалогаЗаТару = СуммаЗалогаЗаТару / СуммаЗалогаПоДокументу * 100;
КонецПроцедуры

&НаКлиенте
Процедура ВариантОплатыПриИзменении(Элемент)
	
	ДанныеЭтапа = Новый Структура;
	ДанныеЭтапа.Вставить("ДатаПлатежа",    ДатаПлатежа);
	ДанныеЭтапа.Вставить("Сдвиг",          Сдвиг);
	ДанныеЭтапа.Вставить("ВариантОтсчета", ВариантОтсчета);
	ДанныеЭтапа.Вставить("ВариантОплаты",  ВариантОплаты);
	ДанныеЭтапа.Вставить("Формула",        Формула);
	
	ПараметрыЗаполненияСдвига = ЭтапыОплатыКлиентСервер.ПараметрыРасчетаДатыПлатежа();
	ПараметрыЗаполненияСдвига.ДатаЗаказа                     = ДатаЗаказа;
	ПараметрыЗаполненияСдвига.ДатаСогласования               = ДатаСогласования;
	ПараметрыЗаполненияСдвига.ДатаОтгрузки                   = Дата(1,1,1);
	ПараметрыЗаполненияСдвига.ДатаПереходаПраваСобственности = ДатаПереходаПраваСобственности;
	ПараметрыЗаполненияСдвига.СрокПереходаПраваСобственности = СрокПереходаПраваСобственности;
	ПараметрыЗаполненияСдвига.Календарь                      = Календарь;
	
	ЭтапыОплатыКлиент.ЭтапыГрафикаОплатыВариантКонтроляПриИзменении(ДанныеЭтапа,ПараметрыЗаполненияСдвига);
	
	ДатаПлатежа = ДанныеЭтапа.ДатаПлатежа;
	ВариантОтсчета = ДанныеЭтапа.ВариантОтсчета;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	ОчиститьСообщения();
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ВариантОплаты",         ВариантОплаты);
	Если НЕ ВариантОтсчетаЗависитОтДатыОтгрузки() Тогда
		
		Если НЕ ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнена дата платежа.'"),,"ДатаПлатежа");
			Возврат;
		КонецЕсли;
		
		СтруктураРезультата.Вставить("ДатаПлатежа",           ДатаПлатежа);
		СтруктураРезультата.Вставить("УдалитьИзмененныйЭтап", ИсходныйВариантОтсчетаЗависитОтДатыОтгрузки);
		
	Иначе
		СтруктураРезультата.Вставить("ДатаПлатежа",           Дата(1,1,1));
	КонецЕсли;
	СтруктураРезультата.Вставить("ПроцентПлатежа",        ПроцентПлатежа);
	СтруктураРезультата.Вставить("СуммаПлатежа",          СуммаПлатежа);
	СтруктураРезультата.Вставить("ВариантОтсчета",        ВариантОтсчета);
	СтруктураРезультата.Вставить("Формула",               Формула);
	СтруктураРезультата.Вставить("Сдвиг",                 Сдвиг);
	СтруктураРезультата.Вставить("СуммаЗалогаЗаТару",     СуммаЗалогаЗаТару);
	СтруктураРезультата.Вставить("ПроцентЗалогаЗаТару",   ПроцентЗалогаЗаТару);
	
	Если Операция = "Изменение" Тогда
		СтруктураРезультата.Вставить("ВариантОплатыПередИзменением",         ВариантОплатыПередИзменением);
		СтруктураРезультата.Вставить("ВариантОтсчетаПередИзменением",        ВариантОтсчетаПередИзменением);
		СтруктураРезультата.Вставить("ФормулаПередИзменением",               ФормулаПередИзменением);
		СтруктураРезультата.Вставить("СдвигПередИзменением",                 СдвигПередИзменением);
	КонецЕсли;
	
	СтруктураРезультата.Вставить("Модифицированность", Модифицированность);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ДатаПлатежа.Видимость = НЕ ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(ВариантОтсчета, Формула);
		
	// При формуле пересчет из даты платежа в сдвиг недоступен
	Элементы.ДатаПлатежа.ТолькоПросмотр = ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.Формула;
	Элементы.Формула.Видимость = ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.Формула;
	Элементы.Сдвиг.Видимость = ВариантОтсчета <> Перечисления.ВариантыОтсчетаДатыПлатежа.ФиксированнаяДата;
	Если НЕ Элементы.Сдвиг.Видимость Тогда
		Сдвиг = 0;
	КонецЕсли;
	
	Если НЕ Элементы.ДатаПлатежа.Видимость Тогда
		ДатаПлатежа = Дата(1,1,1);
	КонецЕсли;
	
	Элементы.СуммаЗалогаЗаТару.Видимость = ЕстьТара;
	Элементы.ПроцентЗалогаЗаТару.Видимость = ЕстьТара;
	Элементы.ВалютаЗалогаЗаТару.Видимость = ЕстьТара;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВариантОтсчета.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВариантОтсчета");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыЗаказа;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='от даты договора'"));
	
КонецПроцедуры

&НаСервере
Функция ВариантОтсчетаЗависитОтДатыОтгрузки()
	Возврат ЭтапыОплатыПовтИсп.СтрокаЭтаповЗависитОтДатыОтгрузки(ВариантОтсчета,Формула);
КонецФункции

#КонецОбласти
